
export interface CardData {
    id: number;
    name: string;
    date: string;
    bio: string;
    imageUrl: string;
    wiki:string;
  }


export const CardProp: CardData[] = [
    {
        id: 1,
        name: "數碼寶貝大冒險",
        date: "1999年3月7日-2000年3月26日，全54話",
        bio: "故事描寫了以同名劇場版《數碼寶貝大冒險》為舞台（1995年）4年後（1999年）的世界。名為「數碼世界」的假象世界與現實世界的東京（尤其是御台場、光丘兩個地方）機緣巧合地連在了一起，主角一行孩子們被突然拋進了異世界中，他們在與搭檔數碼獸的一系列事件中一邊發現自我一邊成長，描寫了孩子們共同活下去的成長故事。一點點被揭露的孩子們的過去，作為被選召理由的光丘之謎等，巧妙的伏筆隨處可見，想方設法地「連大人們也待在其中」。另外，還是一部反映父母離婚和死別等現代日本社會問題的作品。",
        imageUrl:"/images/Digimon_Adventure.gif",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B8%E7%A2%BC%E5%AF%B6%E8%B2%9D%E5%A4%A7%E5%86%92%E9%9A%AA",
    },   
    {
        id: 2,
        name: "數碼寶貝大冒險02",
        date: "2000年4月2日-2001年3月25日，全50話",
        bio: "第一季播映結束後的第一個星期日，即2000年4月2日開始播映，亦於2001年3月25日播映完畢。本季為第一季的續作，繼承了第一季中的登場人物和世界觀，時間設定為上次大冒險（1999年）結束的三年後（2002年）。在本季最後一話清晰地描寫了被選召的孩子們25年後（2027年）的樣貌、職業、子女等場面，讓故事得到了完結。另外，作品中重要的劇情被分割到了遊戲系列的劇情中，這在數碼寶貝動畫系列中，屬於跨媒體展開比較濃厚的作品。",
        imageUrl:"/images/Digimon_Adventure_02LOGO.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B8%E7%A2%BC%E5%AF%B6%E8%B2%9D%E5%A4%A7%E5%86%92%E9%9A%AA02",
        
    },
    {
        id: 3,
        name: "數碼寶貝03馴獸師之王",
        date: "2001年4月1日-2002年3月31日，全51話",
        bio: "故事發生在現實世界，2001年，數碼獸存在於電子遊戲、交換卡片遊戲還有動畫系列。五年級的小學生松田啟人因熱愛數碼怪獸卡片遊戲設計出了一隻數碼獸，因為對真正數碼獸的無比嚮往，某天刷卡機吸收了自己設計的數碼獸令因而他的刷卡器變成了真正的暴龍機——「D-Ark」，之後又認識了李健良和牧野留姬，他們遇到了自己的搭檔數碼獸，與來到現實世界的數碼獸戰鬥。最初的冒險在現實世界展開，然而數碼世界四聖獸之一的朱雀獸為了保護他們的進化之光，不斷派遣帝魔（十二隻以十二神將為原型的數碼獸）來到現實世界，而後又把古樂獸帶走，啟人他們為了救它，帶了博和、樹莉以及健太，決定進入數碼世界。[3]在數碼世界中，啟人一行人又遇到了傳說中的馴獸師[注 9]——秋山遼[注 10]。而後又遇到了被傳送至數碼世界的健良的妹妹——小春。他們8個人在得到了四聖獸的認可後，帶著古樂獸回到現實世界。 但是在消滅真正的敵人「數碼死神（D-Reaper）」之後，因為程式的關係，使得基爾獸他們必須要返回數碼世界。在離別前基爾獸和啟人約定：「之後還是要一起玩喔，要記得喔。」在數碼獸們都回去後，馴獸師們又再度開始了還沒有遇見數碼獸時的生活。但是有一天啟人經過基爾獸曾經住的地方，到裡面察看時，發現了現實世界和數碼世界的大門又打開",
        imageUrl:"/images/Digimon03LOGO.gif",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B8%E7%A2%BC%E5%AF%B6%E8%B2%9D03%E9%A6%B4%E7%8D%B8%E5%B8%AB%E4%B9%8B%E7%8E%8B",
        
    },
    {
        id: 4,
        name: "數碼寶貝04無限地帶",
        date: "2002年4月7日-2003年3月30日，全50話",
        bio: "與《數碼寶貝大冒險》、《數碼寶貝大冒險02》以及《數碼寶貝馴獸師之王》的世界觀等毫無關係的新系列，對比前三作以「沒有搭檔數碼獸」「孩子們自己變身（進化）成數碼獸」這樣的方向展開。這是製作者們對「搭檔數碼獸在戰鬥的時候，孩子們只能看著」這種狀況抱有疑問，改變設定後的產物。東映製作人關弘美談到本作時說「以超級戰隊系列為意識的製作」，主要隊員由5人熱血漢、冷靜的對手、一點紅、少年、大漢構成，以及從敵方成為夥伴的生別的兄弟第六名隊員。與以現實世界為主要舞台的《數碼寶貝馴獸師之王》相對照的，本作基本全篇都以數碼世界為舞台[注 7]，因為「在異世界冒險的幻想故事」這樣的內容、以及沒有搭檔數碼獸這樣的要素，「與數碼獸的羈絆」這樣的本系列共通的主題基本上很薄弱。但是，「在數碼世界旅行」這樣的要點，「與主要人物血脈相連的角色後來加入主角群」，以及「主角群抱有強烈的情結」等繼承原始體系的部分較多。",
        imageUrl:"/images/Digimon04LOGO.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B8%E7%A2%BC%E5%AF%B6%E8%B2%9D04%E7%84%A1%E9%99%90%E5%9C%B0%E5%B8%B6",
    },
    {
        id: 5,
        name: "數碼寶貝05拯救隊",
        date: "2006年4月2日-2007年3月25日，正篇48話、總集篇1話",
        bio: "國中二年級且自稱番長的大門大，在與一群不良少年群毆時，意外地遇到了亞古獸，兩人見面就大打出手，事後亞古獸稱大門大為「大哥」（兄貴），但數碼特搜部隊（DATS，Digital Accident Tactic Squad）不允許未受其管理的數碼獸留在人類世界，必需送回數碼世界，而後湯島浩告訴大門大若加入DATS，他就可以跟數碼世界的強敵戰鬥，大門大因此加入DATS，與藤枝淑乃及托瑪·Ｈ·諾史丁組成小隊，一同解決一系列的數碼獸事件。",
        imageUrl:"/images/Digimon05LOGO.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B8%E7%A2%BC%E5%AF%B6%E8%B2%9D%E6%8B%AF%E6%95%91%E9%9A%8A",
    },
    {
        id: 6,
        name: "數碼寶貝06大匯戰",
        date: "全79話。第一期（第1-30話）於2010年7月6日-2011年3月8日；第二期「邪惡的死亡指揮官與七個王國」（第31-54話）於2011年4月3日-9月25日；第三期「超越時空的少年獵人們」（第55-79話）",
        bio: "相對於前幾作以進化為強化能力主軸，本作則以合體作為主軸，更因此數碼獸之間等級完全消失，也沒有所謂「搭檔數碼獸」的設定。直至數碼寶貝大匯戰 ～邪惡的死亡指揮官與七個王國～，即第30話後重現進化形態，但由於本作設定了數碼獸沒有等級的關係，因此其所謂「超進化」和合體並沒有本質上的差異，後來才設定「超進化」目的只是挽救本系列的舊觀眾對本作的支持與期待。",
        imageUrl:"/images/Digimon06logo.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B0%E7%A0%81%E5%AE%9D%E8%B4%9D%E5%90%88%E4%BD%93%E6%88%98%E4%BA%89",
    },
    {
        id: 7,
        name: "數碼寶貝07-APP獸",
        date: "2016年10月1日-2017年3月25日&2017年4月1日-9月30日，全52話",
        bio: "如今世界各地誰都在使用智慧型手機應用。而在這些應用背後潛藏著人們還不知曉的「APP怪獸」，通稱「APP獸」。APP獸是以自我意志行動的具備人工智慧的APP生命體，在人類世界與數碼空間的狹縫中充當為系統與人類互動的功能。但是，潛伏在網路之海的「兇惡最終BOSS人工智慧·利維坦」利用病毒操控APP獸，開始入侵各種系統，企圖從網路一側控制人類世界。",
        imageUrl:"/images/Digimon07Logo.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B8%E7%A2%BC%E6%9A%B4%E9%BE%8DApp%E4%B8%96%E4%BB%A3",
    },
    {
        id: 8,
        name: "數碼寶貝08大冒險(重製)",
        date: "2020年4月5日-2021年9月26日全67話",
        bio: "網路對於如今人們的生活而言已經是不可或缺的一部分，網路開創了人類世界的未來，在不斷加速的進化中，如今即將連接更多未知領域。但是，人類所不知道的是，在網路的另一面有著一個無限的世界——數碼世界，同時連接人類世界的網路中，棲息著名為數碼獸的生命體。在數碼世界，遙遠的古代，代表光明（神聖）和黑暗（邪惡）的數碼獸勢力曾經發生一場大規模的戰爭，截然對峙的平衡開始崩壞，神聖數碼獸集結古代數碼獸戰士共同將黑暗勢力擊退，但付出了巨大的代價，神聖數碼獸和古代數碼獸戰士幾乎全軍覆沒。如今新的黑暗勢力再次侵襲數碼世界以及通過網路相連的人類世界。在人類世界，2020年的夏天，以日本首都圈為中心的網路持續失控中，一切都託付給了被選召的孩子們去解救神聖數碼獸並喚醒古代數碼獸戰士的靈魂，引導其不斷進化最終臻於完美，超越進化之真理的進化之力，並在其之上繼續征服無限領域。被選召的孩子們和搭檔數碼獸攜手，是阻止兩個世界步向毀滅的希望之光！",
        imageUrl:"/images/Digimon_Adventure_(2020)_Logo.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B0%E7%A0%81%E5%AE%9D%E8%B4%9D%E5%A4%A7%E5%86%92%E9%99%A9%EF%BC%9A",
    },    
    {
        id: 9,
        name: "數碼寶貝09幽靈遊戲",
        date: "2021年10月3日-2023年3月26日正篇67話、特別篇1話",
        bio: "「牠們就在你的身邊」——在新科技發展的近未來，社群網路上流傳著被稱為「全像幽靈」（Hologram Ghost）的真假不明的怪奇現象的傳聞。國中生天之河宙，因為啟動了父親失蹤後留下的名為「暴龍機」（Digivice）的「人体連動育成手環」（Vital Bracelet），開始能看到大家看不見的未知生物——「數碼獸」。從與父親所託付的頑皮數碼獸「伽馬獸」相遇的那天開始，就被捲入了各種怪奇現象中。盜取人類時間的「縫口男」，或是在夜晚徘徊並擄走人類的「木乃伊男」……全像幽靈，就在大家身邊伺機而動。由此開始，便是無人知曉的世界背後的故事。天之河宙、月夜野瑠璃、東御手洗清司郎和搭檔數碼獸一起，踏入了數碼獸生息的不可思議的世界。",
        imageUrl:"/images/Digimon_Ghost_Game_Logo.png",
        wiki:"https://zh.wikipedia.org/zh-tw/%E6%95%B0%E7%A0%81%E5%AE%9D%E8%B4%9D%E5%B9%BD%E7%81%B5%E6%B8%B8%E6%88%8F",
    },

  ];